[
  {
    "id": "concept_001",
    "name": "Ramsey Theory",
    "category": "Graph Theory and Combinatorics",
    "description": "Ramsey theory states that complete disorder is impossible. It explores how order emerges in large enough structures.",
    "visuals": [
      {
        "type": "image",
        "url": "https://mathworld.wolfram.com/images/eps-gif/RamseyGraph_1000.gif",
        "description": "Visualization of Ramsey numbers."
      }
    ],
    "difficulty": "Intermediate"
  },
  {
    "id": "concept_002",
    "name": "Splines",
    "category": "Geometry and Curves",
    "description": "Splines are smooth curves used in computer graphics and interpolation.",
    "visuals": [
      {
        "type": "image",
        "url": "https://mathworld.wolfram.com/images/eps-gif/BicubicSpline_1000.gif",
        "description": "Example of bicubic splines."
      }
    ],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_003",
    "name": "Prime Numbers",
    "category": "Number Theory",
    "description": "Prime numbers are integers greater than 1 that have no divisors other than 1 and themselves.",
    "visuals": [
      {
        "type": "image",
        "url": "https://mathworld.wolfram.com/images/eps-gif/PrimeNumbers_700.gif",
        "description": "Visualization of prime numbers."
      }
    ],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_004",
    "name": "Pigeonhole Principle",
    "category": "Combinatorics",
    "description": "The principle stating that if n items are placed in m containers, where n > m, at least one container must hold more than one item.",
    "visuals": [
      {
        "type": "image",
        "url": "https://mathworld.wolfram.com/images/eps-gif/Pigeonhole_1000.gif",
        "description": "Visual representation of the pigeonhole principle."
      }
    ],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_005",
    "name": "Monte Carlo Method",
    "category": "Probability and Statistics",
    "description": "A computational algorithm that uses random sampling to obtain numerical results and solve problems that might be deterministic in principle.",
    "visuals": [
      {
        "type": "image",
        "url": "https://mathworld.wolfram.com/images/eps-gif/MonteCarloSimulation_1000.gif",
        "description": "Monte Carlo simulation example."
      }
    ],
    "difficulty": "Intermediate"
  },
  {
    "id": "concept_006",
    "name": "No-Free-Lunch Theorem",
    "category": "Optimization and Machine Learning",
    "description": "A theorem stating that no optimization algorithm performs better than others when performance is averaged across all possible problems.",
    "visuals": [
      {
        "type": "diagram",
        "url": "https://mathworld.wolfram.com/images/eps-gif/NoFreeLunchTheorem_1000.gif",
        "description": "Visualization of the No-Free-Lunch theorem."
      }
    ],
    "difficulty": "Advanced"
  },
  {
    "id": "concept_007",
    "name": "Four Color Theorem",
    "category": "Graph Theory",
    "description": "The theorem stating that any map can be colored using no more than four colors such that no two adjacent regions share the same color.",
    "visuals": [
      {
        "type": "image",
        "url": "https://mathworld.wolfram.com/images/eps-gif/FourColorTheorem_1000.gif",
        "description": "Illustration of the Four Color Theorem."
      }
    ],
    "difficulty": "Intermediate"
  },
  {
    "id": "concept_008",
    "name": "Bayesian Inference",
    "category": "Probability and Statistics",
    "description": "A method of statistical inference that updates the probability for a hypothesis as more evidence or information becomes available.",
    "visuals": [
      {
        "type": "image",
        "url": "https://mathworld.wolfram.com/images/eps-gif/BayesianInference_1000.gif",
        "description": "Graphical model of Bayesian inference."
      }
    ],
    "difficulty": "Intermediate"
  },
  {
    "id": "concept_009",
    "name": "Markov Chains",
    "category": "Probability and Statistics",
    "description": "A stochastic process that undergoes transitions from one state to another based on certain probabilistic rules.",
    "visuals": [
      {
        "type": "image",
        "url": "https://mathworld.wolfram.com/images/eps-gif/MarkovChain_1000.gif",
        "description": "Visualization of a Markov chain."
      }
    ],
    "difficulty": "Intermediate"
  },
  {
    "id": "concept_010",
    "name": "Euler's Identity",
    "category": "Complex Analysis",
    "description": "The mathematical formula e^(iπ) + 1 = 0, which is considered one of the most beautiful equations in mathematics.",
    "visuals": [
      {
        "type": "image",
        "url": "https://mathworld.wolfram.com/images/eps-gif/EulersIdentity_1000.gif",
        "description": "Graphical representation of Euler's Identity."
      }
    ],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_011",
    "name": "Artificial life",
    "category": "Alife",
    "description": "Artificial life (ALife or A-Life) is a field of study wherein researchers examine systems related to natural life, its processes, and its evolution, through the use of simulations with computer models, robotics, and biochemistry. The discipline was named by Christopher Langton, an American computer scientist, in 1986. In 1987, Langton organized the first conference on the field, in Los Alamos, New Mexico. There are three main kinds of alife, named for their approaches: soft, from software; hard, from hardware; and wet, from biochemistry. Artificial life researchers study traditional biology by trying to recreate aspects of biological phenomena.",
    "visuals": [
      {
        "type": "image",
        "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Unevolved_swimbots_showing_genetic_diversity.png/330px-Unevolved_swimbots_showing_genetic_diversity.png",
        "description": "Image related to Artificial life"
      }
    ],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_012",
    "name": "Synthetic biology",
    "category": "synthetic biology",
    "description": "Synthetic biology (SynBio) is a multidisciplinary field of science that focuses on living systems and organisms, and it applies engineering principles to develop new biological parts, devices, and systems or to redesign existing systems found in nature.\nIt is a branch of science that encompasses a broad range of methodologies from...",
    "fullArticle": "Synthetic biology (SynBio) is a multidisciplinary field of science that focuses on living systems and organisms, and it applies engineering principles to develop new biological parts, devices, and systems or to redesign existing systems found in nature.\nIt is a branch of science that encompasses a broad range of methodologies from various disciplines, such as biochemistry, biotechnology, biomaterials, material science/engineering, genetic engineering, molecular biology, molecular engineering, systems biology, membrane science, biophysics, chemical and biological engineering, electrical and computer engineering, control engineering and evolutionary biology.\nIt includes designing and constructing biological modules, biological systems, and biological machines, or re-designing existing biological systems for useful purposes.\nAdditionally, it is the branch of science that focuses on the new abilities of engineering into existing organisms to redesign them for useful purposes.\nIn order to produce predictable and robust systems with novel functionalities that do not already exist in nature, it is also necessary to apply the engineering paradigm of systems design to biological systems. According to the European Commission, this possibly involves a molecular assembler based on biomolecular systems such as the ribosome.",
    "visuals": [],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_013",
    "name": "Geomelting",
    "category": "geomelting",
    "description": "GeoMelt is a process by which dangerous, contaminated material (such as radioactive waste and heavy metals) is mixed with clean soil, a blend of industrial minerals, and/or glass frit and melted to create an extremely hard and leach-resistant glass product.  Vitrification immobilizes nearly all of the inorganic contaminants (i.e.,...",
    "fullArticle": "GeoMelt is a process by which dangerous, contaminated material (such as radioactive waste and heavy metals) is mixed with clean soil, a blend of industrial minerals, and/or glass frit and melted to create an extremely hard and leach-resistant glass product.  Vitrification immobilizes nearly all of the inorganic contaminants (i.e., radionuclides and heavy metals) present in the initial mixture by incorporation into the glass matrix. Organic wastes in the melt are destroyed by pyrolysis, and gaseous contaminants released during the melting process are treated separately.\nDeveloped in 1980 by the U.S. Department of Energy's Pacific Northwest National Laboratory (PNNL), the GeoMelt process is deployed in one of two ways: in-situ (in-place) treatment of buried radioactive and hazardous wastes, and In-Container Vitrification (ICV), which is ex-situ treatment where radioactive and hazardous wastes are vitrified in a refractory-lined steel container.",
    "pageUrl": "https://en.wikipedia.org/wiki/Geomelting",
    "visuals": [],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_014",
    "name": "Transdifferentiation",
    "category": "transdifferentiation",
    "description": "Transdifferentiation, also known as lineage reprogramming, is the process in which one mature somatic cell is transformed into another mature somatic cell without undergoing an intermediate pluripotent state or progenitor cell type. It is a type of metaplasia, which includes all cell fate switches, including the interconversion of stem cells....",
    "fullArticle": "Transdifferentiation, also known as lineage reprogramming, is the process in which one mature somatic cell is transformed into another mature somatic cell without undergoing an intermediate pluripotent state or progenitor cell type. It is a type of metaplasia, which includes all cell fate switches, including the interconversion of stem cells. Current uses of transdifferentiation include disease modeling and drug discovery and in the future may include gene therapy and regenerative medicine. The term 'transdifferentiation' was originally coined by Selman and Kafatos in 1974 to describe a change in cell properties as cuticle-producing cells became salt-secreting cells in silk moths undergoing metamorphosis.",
    "pageUrl": "https://en.wikipedia.org/wiki/Transdifferentiation",
    "visuals": [],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_015",
    "name": "Turritopsis dohrnii",
    "category": "transdifferentiation",
    "description": "Turritopsis dohrnii, also known as the immortal jellyfish, is a species of small, biologically immortal jellyfish found worldwide in temperate to tropic waters. It is one of the few known cases of animals capable of completely reverting to a sexually immature, colonial stage after having reached sexual maturity as a...",
    "fullArticle": "Turritopsis dohrnii, also known as the immortal jellyfish, is a species of small, biologically immortal jellyfish found worldwide in temperate to tropic waters. It is one of the few known cases of animals capable of completely reverting to a sexually immature, colonial stage after having reached sexual maturity as a solitary individual.\nLike most other hydrozoans, T. dohrnii begin their lives as tiny, free-swimming larvae known as planulae. As a planula settles down, it gives rise to a colony of polyps that are attached to the sea floor. All the polyps and jellyfish arising from a single planula are genetically identical clones. The polyps form into an extensively branched form, which is not commonly seen in most jellyfish. Jellyfish, also known as medusae, then bud off these polyps and continue their life in a free-swimming form, eventually becoming sexually mature. When sexually mature, they are known to prey on other jellyfish species at a rapid pace. If the T. dohrnii jellyfish is exposed to environmental stress, physical assault, or is sick or old, it can revert to the polyp stage, forming a new polyp colony. It does this through the cell development process of transdifferentiation, which alters the differentiated state of the cells and transforms them into new types of cells.\nTheoretically, this process can go on indefinitely, effectively rendering the jellyfish biologically immortal, although in practice individuals can still die. In nature, most Turritopsis dohrnii are likely to succumb to predation or disease in the medusa stage without reverting to the polyp form.\nThe capability of biological immortality with no maximum lifespan makes T. dohrnii an important target of basic biological aging and pharmaceutical research.",
    "pageUrl": "https://en.wikipedia.org/wiki/Turritopsis_dohrnii",
    "visuals": [],
    "difficulty": "Intermediate"
  },
  {
    "id": "concept_016",
    "name": "Dedifferentiation",
    "category": "transdifferentiation",
    "description": "Dedifferentiation (pronounced dē-ˌdi-fə-ˌren-chē-ˈā-shən) is a transient process by which cells become less specialized and return to an earlier cell state within the same lineage. This suggests an increase in cell potency, meaning that, following dedifferentiation, a cell may possess the ability to re-differentiate into more cell types than it did...",
    "fullArticle": "Dedifferentiation (pronounced dē-ˌdi-fə-ˌren-chē-ˈā-shən) is a transient process by which cells become less specialized and return to an earlier cell state within the same lineage. This suggests an increase in cell potency, meaning that, following dedifferentiation, a cell may possess the ability to re-differentiate into more cell types than it did before dedifferentiation. This is in contrast to differentiation, where differences in gene expression, morphology, or physiology arise in a cell, making its function increasingly specialized.\nThe loss of specialization observed in dedifferentiation can be noted through changes in gene expression, physiology, function within the organism, proliferative activity, or morphology. While it can be induced in a laboratory setting through processes like direct reprogramming and the production of induced pluripotent stem cells, endogenous dedifferentiation processes also exist as a component of wound healing mechanisms.",
    "pageUrl": "https://en.wikipedia.org/wiki/Dedifferentiation",
    "visuals": [],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_017",
    "name": "Metaplasia",
    "category": "transdifferentiation",
    "description": "Metaplasia (from Greek 'change in form') is the transformation of a cell type to another cell type.  The change from one type of cell to another may be part of a normal maturation process, or caused by some sort of abnormal stimulus.  In simplistic terms, it is as...",
    "fullArticle": "Metaplasia (from Greek 'change in form') is the transformation of a cell type to another cell type.  The change from one type of cell to another may be part of a normal maturation process, or caused by some sort of abnormal stimulus.  In simplistic terms, it is as if the original cells are not robust enough to withstand their environment, so they transform into another cell type better suited to their environment. If the stimulus causing metaplasia is removed or ceases, tissues return to their normal pattern of differentiation.  Metaplasia is not synonymous with dysplasia, and is not considered to be an actual cancer.  It is also contrasted with heteroplasia, which is the spontaneous abnormal growth of cytologic and histologic elements. Today, metaplastic changes are usually considered to be an early phase of carcinogenesis, specifically for those with a history of cancers or who are known to be susceptible to carcinogenic changes. Metaplastic change is thus often viewed as a premalignant condition that requires immediate intervention, either surgical or medical, lest it lead to cancer via malignant transformation.",
    "pageUrl": "https://en.wikipedia.org/wiki/Metaplasia",
    "visuals": [],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_018",
    "name": "Biological immortality",
    "category": "immortality",
    "description": "Biological immortality (sometimes referred to as bio-indefinite mortality) is a state in which the rate of mortality from senescence (or aging) is stable or decreasing, thus decoupling it from chronological age. Various unicellular and multicellular species, including some vertebrates, achieve this state either throughout their existence or after living long...",
    "fullArticle": "Biological immortality (sometimes referred to as bio-indefinite mortality) is a state in which the rate of mortality from senescence (or aging) is stable or decreasing, thus decoupling it from chronological age. Various unicellular and multicellular species, including some vertebrates, achieve this state either throughout their existence or after living long enough. A biologically immortal living being can still die from means other than senescence, such as through injury, poison, disease, predation, lack of available resources, or changes to environment.\nThis definition of immortality has been challenged in the Handbook of the Biology of Aging, because the increase in rate of mortality as a function of chronological age may be negligible at extremely old ages, an idea referred to as the late-life mortality plateau. The rate of mortality may cease to increase in old age, but in most cases that rate is typically very high.",
    "pageUrl": "https://en.wikipedia.org/wiki/Biological_immortality",
    "visuals": [],
    "difficulty": "Beginner"
  },
  {
    "id": "concept_019",
    "name": "Intelligent design",
    "category": "design",
    "description": "Intelligent design (ID) is a pseudoscientific argument for the existence of God, presented by its proponents as \"an evidence-based scientific theory about life's origins\". Proponents claim that \"certain features of the universe and of living things are best explained by an intelligent cause, not an undirected process such as natural...",
    "fullArticle": "Intelligent design (ID) is a pseudoscientific argument for the existence of God, presented by its proponents as \"an evidence-based scientific theory about life's origins\". Proponents claim that \"certain features of the universe and of living things are best explained by an intelligent cause, not an undirected process such as natural selection.\" ID is a form of creationism that lacks empirical support and offers no testable or tenable hypotheses, and is therefore not science. The leading proponents of ID are associated with the Discovery Institute, a Christian, politically conservative think tank based in the United States.\nAlthough the phrase intelligent design had featured previously in theological discussions of the argument from design, its first publication in its present use as an alternative term for creationism was in Of Pandas and People, a 1989 creationist textbook intended for high school biology classes. The term was substituted into drafts of the book, directly replacing references to creation science and creationism, after the 1987 Supreme Court's Edwards v. Aguillard decision barred the teaching of creation science in public schools on constitutional grounds. From the mid-1990s, the intelligent design movement (IDM), supported by the Discovery Institute, advocated inclusion of intelligent design in public school biology curricula. This led to the 2005 Kitzmiller v. Dover Area School District trial, which found that intelligent design was not science, that it \"cannot uncouple itself from its creationist, and thus religious, antecedents\", and that the public school district's promotion of it therefore violated the Establishment Clause of the First Amendment to the United States Constitution.\nID presents two main arguments against evolutionary explanations: irreducible complexity and specified complexity, asserting that certain biological and informational features of living things are too complex to be the result of natural selection. Detailed scientific examination has rebutted several examples for which evolutionary explanations are claimed to be impossible.\nID seeks to challenge the methodological naturalism inherent in modern science, though proponents concede that they have yet to produce a scientific theory. As a positive argument against evolution, ID proposes an analogy between natural systems and human artifacts, a version of the theological argument from design for the existence of God. ID proponents then conclude by analogy that the complex features, as defined by ID, are evidence of design. Critics of ID find a false dichotomy in the premise that evidence against evolution constitutes evidence for design.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Intelligent_design",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": []
  },
  {
    "id": "concept_020",
    "name": "Nanoparticle–biomolecule conjugate",
    "category": "",
    "description": "A nanoparticle–biomolecule conjugate is a nanoparticle with biomolecules attached to its surface.  Nanoparticles are minuscule particles, typically measured in nanometers (nm), that are used in nanobiotechnology to explore the functions of biomolecules. Properties of the ultrafine particles are characterized by the components on their surfaces more so than larger...",
    "fullArticle": "A nanoparticle–biomolecule conjugate is a nanoparticle with biomolecules attached to its surface.  Nanoparticles are minuscule particles, typically measured in nanometers (nm), that are used in nanobiotechnology to explore the functions of biomolecules. Properties of the ultrafine particles are characterized by the components on their surfaces more so than larger structures, such as cells, due to large surface area-to-volume ratios. Large surface area-to-volume-ratios of nanoparticles optimize the potential for interactions with biomolecules.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Nanoparticle%E2%80%93biomolecule_conjugate",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Nanomedicine",
      "Nanobiotechnology",
      "Brain-Machine Interfaces"
    ]
  },
  {
    "id": "concept_021",
    "name": "Nanoreactor",
    "category": "",
    "description": "Nanoreactors are a form of chemical reactor that are particularly in the disciplines of nanotechnology and nanobiotechnology. These special reactors are crucial in maintaining a working nanofoundry; which is essentially a foundry that manufactures products on a nanotechnological scale.",
    "fullArticle": "Nanoreactors are a form of chemical reactor that are particularly in the disciplines of nanotechnology and nanobiotechnology. These special reactors are crucial in maintaining a working nanofoundry; which is essentially a foundry that manufactures products on a nanotechnological scale.",
    "pageUrl": "https://en.wikipedia.org/wiki/Nanoreactor",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Nanomedicine",
      "Nanobiotechnology",
      "Brain-Machine Interfaces"
    ]
  },
  {
    "id": "concept_022",
    "name": "Mind uploading",
    "category": "",
    "description": "Mind uploading is a speculative process of whole brain emulation in which a brain scan is used to completely emulate the mental state of the individual in a digital computer. The computer would then run a simulation of the brain's information processing, such that it would respond in essentially the...",
    "fullArticle": "Mind uploading is a speculative process of whole brain emulation in which a brain scan is used to completely emulate the mental state of the individual in a digital computer. The computer would then run a simulation of the brain's information processing, such that it would respond in essentially the same way as the original brain and experience having a sentient conscious mind.\nSubstantial mainstream research in related areas is being conducted in neuroscience and computer science, including animal brain mapping and simulation, development of faster supercomputers, virtual reality, brain–computer interfaces, connectomics, and information extraction from dynamically functioning brains. According to supporters, many of the tools and ideas needed to achieve mind uploading already exist or are under active development; however, they will admit that others are, as yet, very speculative, but say they are still in the realm of engineering possibility.\nMind uploading may potentially be accomplished by either of two methods: copy-and-upload or copy-and-delete by gradual replacement of neurons (which can be considered as a gradual destructive uploading), until the original organic brain no longer exists and a computer program emulating the brain takes control of the body. In the case of the former method, mind uploading would be achieved by scanning and mapping the salient features of a biological brain, and then by storing and copying that information state into a computer system or another computational device. The biological brain may not survive the copying process or may be deliberately destroyed during it in some variants of uploading. The simulated mind could be within a virtual reality or simulated world, supported by an anatomic 3D body simulation model. Alternatively, the simulated mind could reside in a computer inside—or either connected to or remotely controlled by—a (not necessarily humanoid) robot, biological, or cybernetic body.\nAmong some futurists and within part of transhumanist movement, mind uploading is treated as an important proposed life extension or immortality technology (known as \"digital immortality\"). Some believe mind uploading is humanity's current best option for preserving the identity of the species, as opposed to cryonics. Another aim of mind uploading is to provide a permanent backup to our \"mind-file\", to enable interstellar space travel, and a means for human culture to survive a global disaster by making a functional copy of a human society in a computing device. Whole-brain emulation is discussed by some futurists as a \"logical endpoint\" of the topical computational neuroscience and neuroinformatics fields, both about brain simulation for medical research purposes. It is discussed in artificial intelligence research publications as an approach to strong AI (artificial general intelligence) and to at least weak superintelligence. Another approach is seed AI, which would not be based on existing brains. Computer-based intelligence such as an upload could think much faster than a biological human even if it were no more intelligent. A large-scale society of uploads might, according to futurists, give rise to a technological singularity, meaning a sudden time constant decrease in the exponential development of technology. Mind uploading is a central conceptual feature of numerous science fiction novels, films, and games.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Mind_uploading",
    "visuals": [],
    "difficulty": "Advanced",
    "tags": [
      "Whole Brain Emulation"
    ]
  },
  {
    "id": "concept_023",
    "name": "Nanoinformatics",
    "category": "",
    "description": "Nanoinformatics is the application of informatics to nanotechnology.  It is an interdisciplinary field that develops methods and software tools for understanding nanomaterials, their properties, and their interactions with biological entities, and using that information more efficiently.  It differs from cheminformatics in that nanomaterials usually involve nonuniform collections of...",
    "fullArticle": "Nanoinformatics is the application of informatics to nanotechnology.  It is an interdisciplinary field that develops methods and software tools for understanding nanomaterials, their properties, and their interactions with biological entities, and using that information more efficiently.  It differs from cheminformatics in that nanomaterials usually involve nonuniform collections of particles that have distributions of physical properties that must be specified.  The nanoinformatics infrastructure includes ontologies for nanomaterials, file formats, and data repositories.\nNanoinformatics has applications for improving workflows in fundamental research, manufacturing, and environmental health, allowing the use of high-throughput data-driven methods to analyze broad sets of experimental results.  Nanomedicine applications include analysis of nanoparticle-based pharmaceuticals for structure–activity relationships in a similar manner to bioinformatics.",
    "pageUrl": "https://en.wikipedia.org/wiki/Nanoinformatics",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Nanomedicine",
      "Mathematical Modeling"
    ]
  },
  {
    "id": "concept_024",
    "name": "Mathematical and theoretical biology",
    "category": "",
    "description": "Mathematical and theoretical biology, or biomathematics, is a branch of biology which employs theoretical analysis, mathematical models and abstractions of living organisms to investigate the principles that govern the structure, development and behavior of the systems, as opposed to experimental biology which deals with the conduction of experiments to test...",
    "fullArticle": "Mathematical and theoretical biology, or biomathematics, is a branch of biology which employs theoretical analysis, mathematical models and abstractions of living organisms to investigate the principles that govern the structure, development and behavior of the systems, as opposed to experimental biology which deals with the conduction of experiments to test scientific theories. The field is sometimes called mathematical biology or biomathematics to stress the mathematical side, or theoretical biology to stress the biological side. Theoretical biology focuses more on the development of theoretical principles for biology while mathematical biology focuses on the use of mathematical tools to study biological systems, even though the two terms  interchange; overlapping as Artificial Immune Systems of Amorphous Computation.\nMathematical biology aims at the mathematical representation and modeling of biological processes, using techniques and tools of applied mathematics. It can be useful in both theoretical and practical research. Describing systems in a quantitative manner means their behavior can be better simulated, and hence properties can be predicted that might not be evident to the experimenter; requiring mathematical models.\nBecause of the complexity of the living systems, theoretical biology employs several fields of mathematics, and has contributed to the development of new techniques.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Mathematical_and_theoretical_biology",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Life Extension",
      "Regenerative Medicine",
      "Mathematical Modeling"
    ]
  },
  {
    "id": "concept_025",
    "name": "Outline of biotechnology",
    "category": "",
    "description": "The following outline is provided as an overview of and topical guide to biotechnology:\nBiotechnology – field of applied biology that involves the use of living organisms and bioprocesses in engineering, technology, medicine and other fields requiring bioproducts. Biotechnology also utilizes these products for manufacturing purposes.",
    "fullArticle": "The following outline is provided as an overview of and topical guide to biotechnology:\nBiotechnology – field of applied biology that involves the use of living organisms and bioprocesses in engineering, technology, medicine and other fields requiring bioproducts. Biotechnology also utilizes these products for manufacturing purposes.",
    "pageUrl": "https://en.wikipedia.org/wiki/Outline_of_biotechnology",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Nanobiotechnology",
      "Neuroaesthetics / Neuroplasticity",
      "Regenerative Medicine"
    ]
  },
  {
    "id": "concept_026",
    "name": "Artificial enzyme",
    "category": "",
    "description": "See also artificial metalloenzyme.\nAn artificial enzyme is a synthetic organic molecule or ion that recreates one or more functions of an enzyme. It seeks to deliver catalysis at rates and selectivity observed in naturally occurring enzymes.",
    "fullArticle": "See also artificial metalloenzyme.\nAn artificial enzyme is a synthetic organic molecule or ion that recreates one or more functions of an enzyme. It seeks to deliver catalysis at rates and selectivity observed in naturally occurring enzymes.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Artificial_enzyme",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Brain-Machine Interfaces",
      "Nanorobotics",
      "Supramolecular Chemistry"
    ]
  },
  {
    "id": "concept_033",
    "name": "Cyberware",
    "category": "",
    "description": "Cyberware refers to technology that integrates directly with the human nervous system, typically through implants or interfaces that enable communication between machines and the body. \nOnce largely a concept within science fiction, cyberware is now an emerging field of biomedical research and neurotechnology, with applications ranging from brain–computer interfaces to...",
    "fullArticle": "Cyberware refers to technology that integrates directly with the human nervous system, typically through implants or interfaces that enable communication between machines and the body. \nOnce largely a concept within science fiction, cyberware is now an emerging field of biomedical research and neurotechnology, with applications ranging from brain–computer interfaces to advanced prosthetics. The term encompasses both sensory-enhancing implants and control systems that translate neural signals into digital outputs. \nWhile still in its early stages, cyberware has gained renewed interest in the 21st century through companies like Neuralink and BrainGate, as well as ongoing research into human–machine symbiosis.",
    "pageUrl": "https://en.wikipedia.org/wiki/Cyberware",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Brain-Machine Interfaces",
      "Nanobiotechnology"
    ]
  },
  {
    "id": "concept_035",
    "name": "Mental chronometry",
    "category": "",
    "description": "Mental chronometry is the scientific study of processing speed or reaction time on cognitive tasks to infer the content, duration, and temporal sequencing of mental operations. Reaction time (RT; also referred to as \"response time\") is measured by the elapsed time between stimulus onset and an individual's response on elementary...",
    "fullArticle": "Mental chronometry is the scientific study of processing speed or reaction time on cognitive tasks to infer the content, duration, and temporal sequencing of mental operations. Reaction time (RT; also referred to as \"response time\") is measured by the elapsed time between stimulus onset and an individual's response on elementary cognitive tasks (ECTs), which are relatively simple perceptual-motor tasks typically administered in a laboratory setting. Mental chronometry is one of the core methodological paradigms of human experimental, cognitive, and differential psychology, but is also commonly analyzed in psychophysiology, cognitive neuroscience, and behavioral neuroscience to help elucidate the biological mechanisms underlying perception, attention, and decision-making in humans and other species.\nMental chronometry uses measurements of elapsed time between sensory stimulus onsets and subsequent behavioral responses to study the time course of information processing in the nervous system. Distributional characteristics of response times such as means and variance are considered useful indices of processing speed and efficiency, indicating how fast an individual can execute task-relevant mental operations. Behavioral responses are typically button presses, but eye movements, vocal responses, and other observable behaviors are often used. Reaction time is thought to be constrained by the speed of signal transmission in white matter as well as the processing efficiency of neocortical gray matter.\nThe use of mental chronometry in psychological research is far ranging, encompassing nomothetic models of information processing in the human auditory and visual systems, as well as differential psychology topics such as the role of individual differences in RT in human cognitive ability, aging, and a variety of clinical and psychiatric outcomes. The experimental approach to mental chronometry includes topics such as the empirical study of vocal and manual latencies, visual and auditory attention, temporal judgment and integration, language and reading, movement time and motor response, perceptual and decision time, memory, and subjective time perception. Conclusions about information processing drawn from RT are often made with consideration of task experimental design, limitations in measurement technology, and mathematical modeling.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Mental_chronometry",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": [
      "Nanobiotechnology",
      "Aging Biology",
      "Whole Brain Emulation",
      "Mathematical Modeling"
    ]
  },
  {
    "id": "concept_036",
    "name": "Death",
    "category": "",
    "description": "Death is the end of life;  the irreversible cessation of all biological functions that sustain a living organism.  Death eventually and inevitably occurs in all organisms. The remains of a former organism normally begin to decompose shortly after death. Some organisms, such as Turritopsis dohrnii, are biologically immortal;...",
    "fullArticle": "Death is the end of life;  the irreversible cessation of all biological functions that sustain a living organism.  Death eventually and inevitably occurs in all organisms. The remains of a former organism normally begin to decompose shortly after death. Some organisms, such as Turritopsis dohrnii, are biologically immortal; however, they can still die from means other than aging. Death is generally applied to whole organisms; the equivalent for individual components of an organism, such as cells or tissues, is necrosis. Something that is not considered an organism, such as a virus, can be physically destroyed but is not said to die, as a virus is not considered alive in the first place.\nAs of the early 21st century, 56 million people die per year. The most common reason is aging, followed by cardiovascular disease, which is a disease that affects the heart or blood vessels. As of 2022, an estimated total of almost 110 billion humans have died, or roughly 94% of all humans to have ever lived. A substudy of gerontology known as biogerontology seeks to eliminate death by natural aging in humans, often through the application of natural processes found in certain organisms. However, as humans do not have the means to apply this to themselves, they have to use other ways to reach the maximum lifespan for a human, often through lifestyle changes, such as calorie reduction, dieting, and exercise. The idea of lifespan extension is considered and studied as a way for people to live longer.\nDetermining when a person has definitively died has proven difficult. Initially, death was defined as occurring when breathing and the heartbeat ceased, a status still known as clinical death. However, the development of cardiopulmonary resuscitation (CPR) meant that such a state was no longer strictly irreversible. Brain death was then considered a more fitting option, but several definitions exist for this. Some people believe that all brain functions must cease. Others believe that even if the brainstem is still alive, the personality and identity are irretrievably lost, so therefore, the person should be considered entirely dead. Brain death is sometimes used as a legal definition of death. For all organisms with a brain, death can instead be focused on this organ. The cause of death is usually considered important, and an autopsy can be done to determine it. There are many causes, from accidents to diseases.\nMany cultures and religions have a concept of an afterlife. There are also different customs for honoring the body, such as a funeral, cremation, or sky burial. After a death, an obituary may be posted in a newspaper, and the \"survived by\" kin and friends usually go through the grieving process.",
    "pageUrl": "https://en.wikipedia.org/wiki/Death",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": [
      "Nanobiotechnology",
      "Whole Brain Emulation",
      "Life Extension"
    ]
  },
  {
    "id": "concept_039",
    "name": "Applications of nanotechnology",
    "category": "",
    "description": "The applications of nanotechnology, commonly incorporate industrial, medicinal, and energy uses. These include more durable construction materials, therapeutic drug delivery, and higher density hydrogen fuel cells that are environmentally friendly. Being that nanoparticles and nanodevices are highly versatile through modification of their physiochemical properties, they have found uses in nanoscale...",
    "fullArticle": "The applications of nanotechnology, commonly incorporate industrial, medicinal, and energy uses. These include more durable construction materials, therapeutic drug delivery, and higher density hydrogen fuel cells that are environmentally friendly. Being that nanoparticles and nanodevices are highly versatile through modification of their physiochemical properties, they have found uses in nanoscale electronics, cancer treatments, vaccines, hydrogen fuel cells, and nanographene batteries.\n\n \nNanotechnology's use of smaller sized materials allows for adjustment of molecules and substances at the nanoscale level, which can further enhance the mechanical properties of materials or grant access to less physically accessible areas of the body.",
    "pageUrl": "https://en.wikipedia.org/wiki/Applications_of_nanotechnology",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Brain-Machine Interfaces",
      "Supramolecular Chemistry",
      "Nanorobotics",
      "Nanobiotechnology"
    ]
  },
  {
    "id": "concept_040",
    "name": "Molecular tweezers",
    "category": "",
    "description": "Molecular tweezers, and molecular clips, are host molecules with open cavities capable of binding guest molecules.  The open cavity of the molecular tweezers may bind guests using non-covalent bonding, which includes hydrogen bonding, metal coordination, hydrophobic forces, van der Waals forces, π–π interactions, and/or electrostatic effects.  These complexes...",
    "fullArticle": "Molecular tweezers, and molecular clips, are host molecules with open cavities capable of binding guest molecules.  The open cavity of the molecular tweezers may bind guests using non-covalent bonding, which includes hydrogen bonding, metal coordination, hydrophobic forces, van der Waals forces, π–π interactions, and/or electrostatic effects.  These complexes are a subset of macrocyclic molecular receptors and their structure is that the two \"arms\" that bind the guest molecule between them are only connected at one end leading to a certain flexibility of these receptor molecules (induced fit model).",
    "pageUrl": "https://en.wikipedia.org/wiki/Molecular_tweezers",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Brain-Machine Interfaces",
      "Supramolecular Chemistry",
      "Nanorobotics",
      "Nanobiotechnology"
    ]
  },
  {
    "id": "concept_042",
    "name": "Polyvalency (chemistry)",
    "category": "",
    "description": "In chemistry, polyvalency (or polyvalence, multivalency) is the property of molecules and larger species, such as antibodies, medical drugs, and even nanoparticles surface-functionalized with ligands, like spherical nucleic acids, that exhibit more than one supramolecular interaction. For the number of chemical bonds of atoms, the term \"valence\" is used (Fig....",
    "fullArticle": "In chemistry, polyvalency (or polyvalence, multivalency) is the property of molecules and larger species, such as antibodies, medical drugs, and even nanoparticles surface-functionalized with ligands, like spherical nucleic acids, that exhibit more than one supramolecular interaction. For the number of chemical bonds of atoms, the term \"valence\" is used (Fig. 1). For both atoms and larger species, the number of bonds may be specified: divalent species can form two bonds; a trivalent species can form three bonds; and so on.\nSpecies that have polyvalency usually show enhanced or cooperative binding compared to their monovalent counterparts. Nanoparticles with multiple nucleic acid strands on their surfaces (e.g., DNA) can form multiple bonds with one another by DNA hybridization to form hierarchical assemblies, some of which are highly crystalline in nature.",
    "pageUrl": "https://en.wikipedia.org/wiki/Polyvalency_(chemistry)",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Supramolecular Chemistry",
      "Nanobiotechnology",
      "Bioengineering"
    ]
  },
  {
    "id": "concept_044",
    "name": "Soil bioengineering",
    "category": "",
    "description": "Soil and Water Bioengineering is a discipline of civil engineering. It pursues technological, ecological, economic as well as design goals and seeks to achieve these primarily by making use of living materials, i.e. seeds, plants, part of plants and plant communities, and employing them in near–natural constructions while exploiting the...",
    "fullArticle": "Soil and Water Bioengineering is a discipline of civil engineering. It pursues technological, ecological, economic as well as design goals and seeks to achieve these primarily by making use of living materials, i.e. seeds, plants, part of plants and plant communities, and employing them in near–natural constructions while exploiting the manifold abilities inherent in plants.\nSoil bioengineering may sometimes be a substitute for classical engineering works; however, in most cases it is a meaningful and necessary method of complementing the latter.\nIts application suggests itself in all fields of soil and hydraulic engineering, especially for slope and embankment stabilization and erosion control.\nSoil bioengineering is the use of living plant materials to provide some engineering function. Soil bioengineering is an effective tool for treatment of a variety of unstable and / or eroding sites. Soil bioengineering techniques have been used for many centuries. More recently Schiechtl (1980) has encouraged the use of soil bioengineering with a variety of European examples. Soil bioengineering is now widely practiced throughout the world for the treatment of erosion and unstable slopes.",
    "pageUrl": "https://en.wikipedia.org/wiki/Soil_bioengineering",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Bioengineering"
    ]
  },
  {
    "id": "concept_046",
    "name": "Brain-reading",
    "category": "",
    "description": "Brain-reading or thought identification uses the responses of multiple voxels in the brain evoked by stimulus then detected by fMRI in order to decode the original stimulus. Advances in research have made this possible by using human neuroimaging to decode a person's conscious experience based on non-invasive measurements of an...",
    "fullArticle": "Brain-reading or thought identification uses the responses of multiple voxels in the brain evoked by stimulus then detected by fMRI in order to decode the original stimulus. Advances in research have made this possible by using human neuroimaging to decode a person's conscious experience based on non-invasive measurements of an individual's brain activity. Brain reading studies differ in the type of decoding (i.e. classification, identification and reconstruction) employed, the target (i.e. decoding visual patterns, auditory patterns, cognitive states), and the decoding algorithms (linear classification, nonlinear classification, direct reconstruction, Bayesian reconstruction, etc.) employed.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Brain-reading",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Brain-Machine Interfaces",
      "Nanomedicine"
    ]
  },
  {
    "id": "concept_048",
    "name": "Nanorobotics",
    "category": "",
    "description": "Nanoid robotics, or for short, nanorobotics or nanobotics, is an emerging technology field creating machines or robots, which are called nanorobots or simply nanobots, whose components are at or near the scale of a nanometer (10−9 meters). More specifically, nanorobotics (as opposed to microrobotics) refers to the nanotechnology engineering discipline...",
    "fullArticle": "Nanoid robotics, or for short, nanorobotics or nanobotics, is an emerging technology field creating machines or robots, which are called nanorobots or simply nanobots, whose components are at or near the scale of a nanometer (10−9 meters). More specifically, nanorobotics (as opposed to microrobotics) refers to the nanotechnology engineering discipline of designing and building nanorobots with devices ranging in size from 0.1 to 10 micrometres and constructed of nanoscale or molecular components. The terms nanobot, nanoid, nanite, nanomachine and nanomite have also been used to describe such devices currently under research and development.\nNanomachines are largely in the research and development phase, but some primitive molecular machines and nanomotors have been tested. An example is a sensor having a switch approximately 1.5 nanometers across, able to count specific molecules in the chemical sample. The first useful applications of nanomachines may be in nanomedicine. For example, biological machines could be used to identify and destroy cancer cells. Another potential application is the detection of toxic chemicals, and the measurement of their concentrations, in the environment. Rice University has demonstrated a single-molecule car developed by a chemical process and including Buckminsterfullerenes (buckyballs) for wheels. It is actuated by controlling the environmental temperature and by positioning a scanning tunneling microscope tip.\nAnother definition is a robot that allows precise interactions with nanoscale objects, or can manipulate with nanoscale resolution. Such devices are more related to microscopy or scanning probe microscopy, instead of the description of nanorobots as molecular machines. Using the microscopy definition, even a large apparatus such as an atomic force microscope can be considered a nanorobotic instrument when configured to perform nanomanipulation. For this viewpoint, macroscale robots or microrobots that can move with nanoscale precision can also be considered nanorobots.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Nanorobotics",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": [
      "Nanobiotechnology",
      "Supramolecular Chemistry",
      "Nanomedicine",
      "Nanorobotics"
    ]
  },
  {
    "id": "concept_050",
    "name": "Synaptic weight",
    "category": "",
    "description": "In neuroscience and computer science, synaptic weight refers to the strength or amplitude of a connection between two nodes, corresponding in biology to the amount of influence the firing of one neuron has on another. The term is typically used in artificial and biological neural network research.",
    "fullArticle": "In neuroscience and computer science, synaptic weight refers to the strength or amplitude of a connection between two nodes, corresponding in biology to the amount of influence the firing of one neuron has on another. The term is typically used in artificial and biological neural network research.",
    "pageUrl": "https://en.wikipedia.org/wiki/Synaptic_weight",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Nanobiotechnology",
      "Supramolecular Chemistry",
      "Neuroaesthetics / Neuroplasticity"
    ]
  },
  {
    "id": "concept_051",
    "name": "Action (philosophy)",
    "category": "Praxeology",
    "description": "In philosophy, an action is something an agent does. Actions contrast with events which merely happen to someone and are typically performed for a purpose and guided by an intention. The first question in the philosophy of action is to determine how actions differ from other forms of behavior, like...",
    "fullArticle": "In philosophy, an action is something an agent does. Actions contrast with events which merely happen to someone and are typically performed for a purpose and guided by an intention. The first question in the philosophy of action is to determine how actions differ from other forms of behavior, like involuntary reflexes. According to Ludwig Wittgenstein, it involves discovering \"What is left over if I subtract the fact that my arm goes up from the fact that I raise my arm\". A common response to this question focuses on the agent's intentions. So driving a car is an action since the agent intends to do so, but sneezing is a mere behavior since it happens independent of the agent's intention. The dominant theory of the relation between the intention and the behavior is causalism: driving the car is an action because it is caused by the agent's intention to do so. On this view, actions are distinguished from other events by their causal history. Causalist theories include Donald Davidson's account, which defines actions as bodily movements caused by intentions in the right way, and volitionalist theories, according to which volitions form a core aspect of actions. Non-causalist theories, on the other hand, often see intentions not as the action's cause but as a constituent of it.\nAn important distinction among actions is between non-basic actions, which are done by doing something else, and basic actions, for which this is not the case. Most philosophical discussions of actions focus on physical actions in the form of bodily movements. But many philosophers consider mental actions to be a distinct type of action that has characteristics quite different from physical actions. Deliberations and decisions are processes that often precede and lead to actions. Actions can be rational or irrational depending on the reason for which they are performed. The problem of responsibility is closely related to the philosophy of actions since we usually hold people responsible for what they do.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Action_(philosophy)",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": []
  },
  {
    "id": "concept_052",
    "name": "Blue Brain Project",
    "category": "",
    "description": "The Blue Brain Project was a Swiss brain research initiative that aimed to create a digital reconstruction of the mouse brain. The project was founded in May 2005 by the Brain Mind Institute of École Polytechnique Fédérale de Lausanne (EPFL) in Switzerland. The project ended in December 2024. Its mission...",
    "fullArticle": "The Blue Brain Project was a Swiss brain research initiative that aimed to create a digital reconstruction of the mouse brain. The project was founded in May 2005 by the Brain Mind Institute of École Polytechnique Fédérale de Lausanne (EPFL) in Switzerland. The project ended in December 2024. Its mission was to use biologically-detailed digital reconstructions and simulations of the mammalian brain to identify the fundamental principles of brain structure and function.\nThe project was headed by the founding director Henry Markram—who also launched the European Human Brain Project—and was co-directed by Felix Schürmann, Adriana Salvatore and Sean Hill. Using a Blue Gene supercomputer running Michael Hines's NEURON, the simulation involved a biologically realistic model of neurons and an empirically reconstructed model connectome.\nThere were a number of collaborations, including the Cajal Blue Brain, which is coordinated by the Supercomputing and Visualization Center of Madrid (CeSViMa), and others run by universities and independent laboratories.",
    "pageUrl": "https://en.wikipedia.org/wiki/Blue_Brain_Project",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Whole Brain Emulation",
      "Nanorobotics",
      "Bioengineering"
    ]
  },
  {
    "id": "concept_053",
    "name": "Cognitive development",
    "category": "",
    "description": "Cognitive development is a field of study in neuroscience and psychology focusing on a child's development in terms of information processing, conceptual resources, perceptual skill, language learning, and other aspects of the developed adult brain and cognitive psychology.  Qualitative differences between how a child processes their waking experience and...",
    "fullArticle": "Cognitive development is a field of study in neuroscience and psychology focusing on a child's development in terms of information processing, conceptual resources, perceptual skill, language learning, and other aspects of the developed adult brain and cognitive psychology.  Qualitative differences between how a child processes their waking experience and how an adult processes their waking experience are acknowledged (such as object permanence, the understanding of logical relations, and cause-effect reasoning in school-age children). Cognitive development is defined as the emergence of the ability to consciously cognize, understand, and articulate their understanding in adult terms. Cognitive development is how a person perceives, thinks, and gains understanding of their world through the relations of genetic and learning factors. There are four stages to cognitive information development. They are, reasoning, intelligence, language, and memory. These stages start when the baby is about 18 months old, they play with toys, listen to their parents speak, they watch TV, anything that catches their attention helps build their cognitive development.\nJean Piaget was a major force establishing this field, forming his \"theory of cognitive development\". Piaget proposed four stages of cognitive development: the sensorimotor, preoperational, concrete operational, and formal operational period. Many of Piaget's theoretical claims have since fallen out of favor. His description of the most prominent changes in cognition with age, is generally still accepted today (e.g., how early perception moves from being dependent on concrete, external actions.  Later,  abstract understanding of observable aspects of reality can be captured; leading to the discovery of underlying abstract rules and principles, usually starting in adolescence)\nIn recent years, however, alternative models have been advanced, including information-processing theory, neo-Piagetian theories of cognitive development, which aim to integrate Piaget's ideas with more recent models and concepts in developmental and cognitive science, theoretical cognitive neuroscience, and social-constructivist approaches. Another such model of cognitive development is Bronfenbrenner's Ecological Systems Theory. A major controversy in cognitive development has been \"nature versus nurture\", i.e.,  the question if cognitive development is mainly determined by an individual's innate qualities (\"nature\"), or by their personal experiences (\"nurture\"). However, it is now recognized by most experts that this is a false dichotomy: there is overwhelming evidence from biological and behavioral sciences that from the earliest points in development, gene activity interacts with events and experiences in the environment. While naturalists are convinced of the power of genetic mechanisms, knowledge from different disciplines, such as Comparative psychology, Molecular biology, and Neuroscience, shows arguments for an ecological component in launching cognition (see the section \"The beginning of cognition\" below).\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Cognitive_development",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": [
      "Whole Brain Emulation",
      "Nanorobotics",
      "Bioengineering"
    ]
  },
  {
    "id": "concept_056",
    "name": "Nucleus accumbens",
    "category": "",
    "description": "The nucleus accumbens (NAc or NAcc; also known as the accumbens nucleus, or formerly as the nucleus accumbens septi, Latin for 'nucleus adjacent to the septum') is a region in the basal forebrain rostral to the preoptic area of the hypothalamus. The nucleus accumbens and the olfactory tubercle collectively form...",
    "fullArticle": "The nucleus accumbens (NAc or NAcc; also known as the accumbens nucleus, or formerly as the nucleus accumbens septi, Latin for 'nucleus adjacent to the septum') is a region in the basal forebrain rostral to the preoptic area of the hypothalamus. The nucleus accumbens and the olfactory tubercle collectively form the ventral striatum. The ventral striatum and dorsal striatum collectively form the striatum, which is the main component of the basal ganglia. The dopaminergic neurons of the mesolimbic pathway project onto the GABAergic medium spiny neurons of the nucleus accumbens and olfactory tubercle. Each cerebral hemisphere has its own nucleus accumbens, which can be divided into two structures: the nucleus accumbens core and the nucleus accumbens shell.  These substructures have different morphology and functions.\nDifferent NAcc subregions (core vs shell) and neuron subpopulations within each region (D1-type vs D2-type medium spiny neurons) are responsible for different cognitive functions. As a whole, the nucleus accumbens has a significant role in the cognitive processing of motivation, aversion, reward (i.e., incentive salience, pleasure, and positive reinforcement), and reinforcement learning (e.g., Pavlovian-instrumental transfer); hence, it has a significant role in addiction. In addition, part of the nucleus accumbens core is centrally involved in the induction of slow-wave sleep. The nucleus accumbens plays a lesser role in processing fear (a form of aversion), impulsivity, and the placebo effect. It is involved in the encoding of new motor programs as well.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Nucleus_accumbens",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": [
      "Brain-Machine Interfaces",
      "Neuroaesthetics / Neuroplasticity"
    ]
  },
  {
    "id": "concept_060",
    "name": "Artificial gene synthesis",
    "category": "",
    "description": "Artificial gene synthesis, or simply gene synthesis, refers to a group of methods that are used in synthetic biology to construct and assemble genes from nucleotides de novo. Unlike DNA synthesis in living cells, artificial gene synthesis does not require template DNA, allowing virtually any DNA sequence to be synthesized...",
    "fullArticle": "Artificial gene synthesis, or simply gene synthesis, refers to a group of methods that are used in synthetic biology to construct and assemble genes from nucleotides de novo. Unlike DNA synthesis in living cells, artificial gene synthesis does not require template DNA, allowing virtually any DNA sequence to be synthesized in the laboratory. It comprises two main steps, the first of which is solid-phase DNA synthesis, sometimes known as DNA printing. This produces oligonucleotide fragments that are generally under 200 base pairs. The second step then involves connecting these oligonucleotide fragments using various DNA assembly methods. Because artificial gene synthesis does not require template DNA, it is theoretically possible to make a completely synthetic DNA molecule with no limits on the nucleotide sequence or size.\nSynthesis of the first complete gene, a yeast tRNA, was demonstrated by Har Gobind Khorana and coworkers in 1972. Synthesis of the first peptide- and protein-coding genes was performed in the laboratories of Herbert Boyer and Alexander Markham, respectively. More recently, artificial gene synthesis methods have been developed that will allow the assembly of entire chromosomes and genomes. The first synthetic yeast chromosome was synthesised in 2014, and entire functional bacterial chromosomes have also been synthesised. In addition, artificial gene synthesis could in the future make use of novel nucleobase pairs (unnatural base pairs).\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Artificial_gene_synthesis",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": [
      "Multiomics",
      "Synthetic Biology"
    ]
  },
  {
    "id": "concept_061",
    "name": "Xeno nucleic acid",
    "category": "xenobiology",
    "description": "Xenonucleic acids (XNAs) are synthetic nucleic acid analogues that are engineered with structurally distinct components, such as alternative nucleosides, sugars, or backbones.\nXNAs have fundamentally different properties from endogenous nucleic acids, enabling different specialized applications, such as therapeutics, probes, or functional molecules. For instance, peptide nucleic acids, the backbones of which...",
    "fullArticle": "Xenonucleic acids (XNAs) are synthetic nucleic acid analogues that are engineered with structurally distinct components, such as alternative nucleosides, sugars, or backbones.\nXNAs have fundamentally different properties from endogenous nucleic acids, enabling different specialized applications, such as therapeutics, probes, or functional molecules. For instance, peptide nucleic acids, the backbones of which are made up of repeating aminoethylglycine units, are extremely stable and resistant to degradation by nucleases because they are not recognised.\nThe same nucleobases can be used to store genetic information and interact with DNA, RNA, or other XNA bases, but the different backbone gives the compound different properties. Their altered chemical structure means they cannot be processed by naturally occurring cellular processes. For instance, natural DNA polymerases cannot read and duplicate the alien information, thus the genetic information stored in XNA is invisible to DNA-based organisms.\nAs of 2011, at least six types of synthetic sugars have been shown to form nucleic acid backbones that can store and retrieve genetic information. Research is now being focused to create synthetic polymerases to transform XNAs. The study of the production and application of XNA molecules has created the field of current xenobiology.",
    "pageUrl": "https://en.wikipedia.org/wiki/Xeno_nucleic_acid",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": []
  },
  {
    "id": "concept_062",
    "name": "Critical phenomena",
    "category": "Ising",
    "description": "In physics, critical phenomena is the collective name associated with the\nphysics of critical points. Most of them stem from the divergence of the \ncorrelation length, but also the dynamics slows down. Critical phenomena include scaling relations among different quantities, power-law divergences of some quantities (such as the magnetic susceptibility in...",
    "fullArticle": "In physics, critical phenomena is the collective name associated with the\nphysics of critical points. Most of them stem from the divergence of the \ncorrelation length, but also the dynamics slows down. Critical phenomena include scaling relations among different quantities, power-law divergences of some quantities (such as the magnetic susceptibility in the ferromagnetic phase transition) described by critical exponents, universality, fractal behaviour, and ergodicity breaking. Critical phenomena take place in second order phase transitions, although not exclusively.\nThe critical behavior is usually different from the mean-field approximation which is valid away from the phase transition, since the latter neglects correlations, which become increasingly important as the system approaches the critical point where the correlation length diverges. Many properties of the critical behavior of a system can be derived in the framework of the renormalization group.\nIn order to explain the physical origin of these phenomena, we shall use the Ising model as a pedagogical example.",
    "pageUrl": "https://en.wikipedia.org/wiki/Critical_phenomena",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": []
  },
  {
    "id": "concept_063",
    "name": "Nonsynaptic plasticity",
    "category": "",
    "description": "Nonsynaptic plasticity is a form of neuroplasticity that involves modification of ion channel function in the axon, dendrites, and cell body that results in specific changes in the integration of excitatory postsynaptic potentials and inhibitory postsynaptic potentials. Nonsynaptic plasticity is a modification of the intrinsic excitability of the neuron. ...",
    "fullArticle": "Nonsynaptic plasticity is a form of neuroplasticity that involves modification of ion channel function in the axon, dendrites, and cell body that results in specific changes in the integration of excitatory postsynaptic potentials and inhibitory postsynaptic potentials. Nonsynaptic plasticity is a modification of the intrinsic excitability of the neuron.  It interacts with synaptic plasticity, but it is considered a separate entity from synaptic plasticity.  Intrinsic modification of the electrical properties of neurons plays a role in many aspects of plasticity from homeostatic plasticity to learning and memory itself.  Nonsynaptic plasticity affects synaptic integration, subthreshold propagation, spike generation, and other fundamental mechanisms of neurons at the cellular level.  These individual neuronal alterations can result in changes in higher brain function, especially learning and memory.  However, as an emerging field in neuroscience, much of the knowledge about nonsynaptic plasticity is uncertain and still requires further investigation to better define its role in brain function and behavior.\n\n",
    "pageUrl": "https://en.wikipedia.org/wiki/Nonsynaptic_plasticity",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Nanobiotechnology",
      "Supramolecular Chemistry",
      "Neuroaesthetics / Neuroplasticity"
    ]
  },
  {
    "id": "concept_064",
    "name": "DNA walker",
    "category": "",
    "description": "A DNA walker is a class of nucleic acid nanomachines where a nucleic acid \"walker\" is able to move along a nucleic acid \"track\". The concept of a DNA walker was first defined and named by John H. Reif in 2003.\nA nonautonomous DNA walker requires external changes for each step,...",
    "fullArticle": "A DNA walker is a class of nucleic acid nanomachines where a nucleic acid \"walker\" is able to move along a nucleic acid \"track\". The concept of a DNA walker was first defined and named by John H. Reif in 2003.\nA nonautonomous DNA walker requires external changes for each step, whereas an autonomous DNA walker progresses without any external changes. Various nonautonomous DNA walkers were developed, for example Shin   controlled the motion of DNA walker by using 'control strands' which needed to be manually added in a specific order according to the template's sequence in order to get the desired path of motion.\nIn 2004 the first autonomous DNA walker, which did not require external changes for each step,  was experimentally demonstrated by the Reif group. \nDNA walkers have functional properties such as a range of motion extending from linear to 2 and 3-dimensional, the ability to pick up and drop off molecular cargo, performing DNA-templated synthesis, and increased velocity of motion. DNA walkers have potential applications ranging from nanomedicine to nanorobotics. Many different fuel options have been studied including DNA hybridization, hydrolysis of DNA or ATP, and light. The DNA walker's function is similar to that of the proteins dynein and kinesin.",
    "pageUrl": "https://en.wikipedia.org/wiki/DNA_walker",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": [
      "Nanobiotechnology",
      "Nanorobotics"
    ]
  },
  {
    "id": "concept_065",
    "name": "Nanomedicine",
    "category": "",
    "description": "Nanomedicine is the medical application of nanotechnology. Nanomedicine ranges from the medical applications of nanomaterials and biological devices, to nanoelectronic biosensors, and even possible future applications of molecular nanotechnology such as biological machines. Current problems for nanomedicine involve understanding the issues related to toxicity and environmental impact of nanoscale materials...",
    "fullArticle": "Nanomedicine is the medical application of nanotechnology. Nanomedicine ranges from the medical applications of nanomaterials and biological devices, to nanoelectronic biosensors, and even possible future applications of molecular nanotechnology such as biological machines. Current problems for nanomedicine involve understanding the issues related to toxicity and environmental impact of nanoscale materials (materials whose structure is on the scale of nanometers, i.e. billionths of a meter).\n\n \nFunctionalities can be added to nanomaterials by interfacing them with biological molecules or structures. The size of nanomaterials is similar to that of most biological molecules and structures; therefore, nanomaterials can be useful for both in vivo and in vitro biomedical research and applications. Thus far, the integration of nanomaterials with biology has led to the development of diagnostic devices, contrast agents, analytical tools, physical therapy applications, and drug delivery vehicles.\nNanomedicine seeks to deliver a valuable set of research tools and clinically useful devices in the near future. The National Nanotechnology Initiative expects new commercial applications in the pharmaceutical industry that may include advanced drug delivery systems, new therapies, and in vivo imaging. Nanomedicine research is receiving funding from the US National Institutes of Health Common Fund program, supporting four nanomedicine development centers. The goal of funding this newer form of science is to further develop the biological, biochemical, and biophysical mechanisms of living tissues.  More medical and drug companies today are becoming involved in nanomedical research and medications. These include Bristol-Myers Squibb, which focuses on drug delivery systems for immunology and fibrotic diseases; Moderna known for their COVID-19 vaccine and their work on mRNA therapeutics; and Nanobiotix, a company that focuses on cancer and currently has a drug in testing that increases the effect of radiation on targeted cells. More companies include Generation Bio, which specializes in genetic medicines and has developed the cell-targeted lipid nanoparticle, and Jazz Pharmaceuticals, which developed Vyxeos , a drug that treats acute myeloid leukemia, and concentrates on cancer and neuroscience. Cytiva is a company that specializes in producing delivery systems for genomic medicines that are non-viral, including mRNA vaccines and other therapies utilizing nucleic acid and Ratiopharm is known for manufacturing Pazenir, a drug for various cancers. Finally, Pacira specializes in pain management and is known for producing ZILRETTA for osteoarthritis knee pain, the first treatment without opioids. \nNanomedicine sales reached $16 billion in 2015, with a minimum of $3.8 billion in nanotechnology R&D being invested every year. Global funding for emerging nanotechnology increased by 45% per year in recent years, with product sales exceeding $1 trillion in 2013. In 2023, the global market was valued at $189.55 billion and is predicted to exceed $ 500 billion in the next ten years. As the nanomedicine industry continues to grow, it is expected to have a significant impact on the economy.",
    "pageUrl": "https://en.wikipedia.org/wiki/Nanomedicine",
    "visuals": [],
    "difficulty": "Intermediate",
    "tags": [
      "Nanobiotechnology",
      "Nanorobotics"
    ]
  },
  {
    "id": "concept_066",
    "name": "List of hexapod robots",
    "category": "",
    "description": "This is a list of hexapod robots.",
    "fullArticle": "This is a list of hexapod robots.",
    "pageUrl": "https://en.wikipedia.org/wiki/List_of_hexapod_robots",
    "visuals": [],
    "difficulty": "Beginner",
    "tags": [
      "Nanobiotechnology",
      "Nanorobotics"
    ]
  }
]